[
    {
        "total scraped": 3015,
        "total youngest": 89,
        "average number of siblings": 3.76
    },
    {
        "name": "Mo Amer",
        "bio": "Amer is of Palestinian descent, and the youngest of six children.[1] Amer's father worked as an engineer for the Kuwait Oil Company.[2] In October 1990, at the age of nine, Amer, his sister, Haifa, his brother, and mother fled his birth country of Kuwait during the Gulf War. They emigrated to the United States and settled in Houston, Texas.[3][4]\n",
        "url": "https://en.wikipedia.org/wiki/Mo_Amer",
        "num_siblings": 5
    },
    {
        "name": "The Try Guys",
        "bio": "Keith Douglas Habersberger[31] (born June 18, 1987, in Carthage, Tennessee; /ˈhæbərsbɜːrɡər/ HABB-urs-bur-gur[32]) was born to Donald and Patricia Habersberger. He is the youngest of three brothers.[33][34] He is a graduate of Illinois State University with a Bachelor in acting and French horn.[35] Habersberger is married to Rebecca \"Becky\" Habersberger (née Miller).[36] Habersberger is reportedly 6 feet 3 inches (1.91 m), making him the tallest of the Try Guys.[37]\n",
        "url": "https://en.wikipedia.org/wiki/The_Try_Guys",
        "num_siblings": 2
    },
    {
        "name": "Ali Wong",
        "bio": "Alexandra Dawn Wong[4] was born in the Pacific Heights neighborhood of San Francisco, California, on April 19, 1982,[5][6] the youngest of four children.[5][7] Her Vietnamese mother, Tam \"Tammy\" Wong, relocated from Huế in 1960 to work as a social worker in the U.S.[5][8][9] Her Chinese-American father, Adolphus Wong (1937–2011), was an anesthesiologist who worked for Kaiser Permanente for 30 years.[10]\n",
        "url": "https://en.wikipedia.org/wiki/Ali_Wong",
        "num_siblings": 3
    },
    {
        "name": "Luke Wilson",
        "bio": "Wilson was born in Dallas the youngest of three sons of Robert Andrew Wilson (1941–2017), an advertising and television executive, and his wife Laura (née Cunningham; born 1939), a photographer.[2] His family, originally from Massachusetts, is of Irish Catholic descent.[3] \n",
        "url": "https://en.wikipedia.org/wiki/Luke_Wilson",
        "num_siblings": 2
    },
    {
        "name": "Cardis Cardell Willis",
        "bio": "Willis was born in 1937, either on April 20, or August 3. The discrepancy is due to the remoteness of his hometown of Forest, Mississippi, and the fact that births had to be reported in the capital of Jackson at the time. He was born to William and Pearlie Mae Willis.  He was the youngest of eight. His siblings included William, Joseph, Lilly Mae, and Geneva.\n",
        "url": "https://en.wikipedia.org/wiki/Cardis_Cardell_Willis",
        "num_siblings": 7
    },
    {
        "name": "Marlon Wayans",
        "bio": "Wayans was born in New York City, the son of Elvira Alethia (Green), a homemaker and social worker, and Howell Stouten Wayans, a supermarket manager.[7] His family were Jehovah's Witnesses.[8][9] Wayans was raised in the housing projects of New York City, the youngest of ten siblings. He is the brother of Nadia, Shawn, Keenen Ivory, Damon, Dwayne, and Kim. Wayans went to Fiorello H. LaGuardia High School of Music &amp; Art and Performing Arts in New York City, the school made famous in Fame. After graduating from high school, he attended Howard University in Washington, D.C., before dropping out after two years.[10]\n",
        "url": "https://en.wikipedia.org/wiki/Marlon_Wayans",
        "num_siblings": 9
    },
    {
        "name": "Mark Wahlberg",
        "bio": "Mark Robert Michael Wahlberg was born on June 5, 1971, in the Dorchester neighborhood of Boston, Massachusetts. He is the youngest of nine children,[2] including actor Robert and singer/actor Donnie. His mother, Alma Elaine (née Donnelly; 1942–2021), was a bank clerk and a nurse's aide, and his father, Donald Edmond Wahlberg Sr. (1930–2008[3]), was a delivery driver[4][3] and U.S. Army veteran of the Korean War. Wahlberg's parents divorced in 1982; afterward, he divided his time between them.[5]\n",
        "url": "https://en.wikipedia.org/wiki/Mark_Wahlberg",
        "num_siblings": 8
    },
    {
        "name": "Nick Swardson",
        "bio": "A native of the Minneapolis–Saint Paul area, Swardson was born to Pamela and Roger Eric Swardson, and is the youngest of three siblings—he has a sister, Rachel, and a brother, John.[7][8][9]  Roger Swardson (1934–2003) was an editor and journalist—having written for publications such as the Cincinnati Enquirer and City Pages, as well as founding the Grand Gazette, a former Saint Paul community newspaper.[7] Roger Swardson also invested in land development in Saint Paul, revitalizing Grand Avenue—an area now known as Victoria Crossing.[7] Roger and Pamela divorced in 1989.[7] Swardson has Swedish ancestry.[10][11]\n",
        "url": "https://en.wikipedia.org/wiki/Nick_Swardson",
        "num_siblings": 2
    },
    {
        "name": "David Steinberg",
        "bio": "Steinberg was born on August 9, 1942 in Winnipeg, Manitoba, Canada. He is the son of Rabbi Yasha Steinberg (1896-1966), a strict, Romanian-born rabbi, and Ruth Steinberg (circa 1904-1989). He is the youngest of four children and has three older siblings: two older brothers, Hymie Steinberg (1925-1944) and Fishy Steinberg, and one older sister, Tammy Lazer (née Steinberg).[2][3] His elder brother Hymie served during World War II and was killed in action when he was  19.[4] David initially studied theology in Israel.[1][5] Later, while studying English Literature at the University of Chicago, he decided to become a comedian after seeing Lenny Bruce perform.[1] He finished school and was discovered by one of the founders of The Second City in Chicago, which he joined in 1964. There he performed with Robert Klein, Fred Willard, Peter Boyle, and Joe Flaherty. He remained with the group for six years.[1] In 1972, Steinberg was best man at the wedding of his friend, the gangster Crazy Joe Gallo.[6]\n",
        "url": "https://en.wikipedia.org/wiki/David_Steinberg",
        "num_siblings": 3
    },
    {
        "name": "Frank Skinner",
        "bio": "Skinner was born on 28 January 1957 in West Bromwich, Staffordshire, England, and grew up in a council house in neighbouring Oldbury.[3] He was the youngest of four children born to John Collins (1918–1990) and his wife Doris (1919–1989).\n",
        "url": "https://en.wikipedia.org/wiki/Frank_Skinner",
        "num_siblings": 3
    },
    {
        "name": "Sarah Silverman",
        "bio": "Sarah Silverman was born on December 1, 1970, in Bedford, New Hampshire, to Beth Ann née Halpin (1941–2015) and Donald Silverman.[7] She was raised in Manchester, New Hampshire. Beth had been George McGovern's personal campaign photographer and founded the theater company New Thalian Players, while Donald trained as a social worker and also ran the clothing store Crazy Sophie's Outlet.[8][9] Silverman's parents divorced and later married others.[10][11] Silverman is the youngest of five siblings. Her sisters are Reform rabbi Susan Silverman, writer Jodyne Speyer and actress Laura Silverman; her brother Jeffrey Michael died when he was three months old.[12] Born into a Jewish family,[13] she considers herself secular and non-religious.[14][15][16] She was in attendance when women lit menorahs at the Western Wall for the first time, in December 2014.[17] Her ancestors were from Poland and Russia.[18]\n",
        "url": "https://en.wikipedia.org/wiki/Sarah_Silverman",
        "num_siblings": 4
    },
    {
        "name": "Martin Short",
        "bio": "Short was born on March 26, 1950, in Hamilton, Ontario, the youngest of five children of Olive Grace (née Hayter; 1913–1968), a concertmistress of the Hamilton Symphony Orchestra,[5] and Charles Patrick Short (1909–1970), a corporate executive with Stelco, a Canadian steel company. He and his siblings were raised as Catholics.[6] He had three older brothers, David (now deceased), Michael, and Brian, and one older sister, Nora.[7][8] Short's father was an Irish Catholic emigrant from Crossmaglen, South Armagh in Northern Ireland, who came to North America as a stowaway during the Irish War of Independence.[9][10] Short's mother was of English and Irish descent. She encouraged his early creative endeavours.[6] His eldest brother, David, was killed in a car accident in Montréal in 1962 when Short was 12. His mother died of cancer in 1968, his father two years later of complications from a stroke.[11]\n",
        "url": "https://en.wikipedia.org/wiki/Martin_Short",
        "num_siblings": 4
    },
    {
        "name": "George Segal",
        "bio": "George Segal Jr. was born in New York City,[5][6][7] the youngest of four children to Fannie Blanche Segal (née Bodkin) and George Segal Sr., a malt and hop agent. He spent much of his childhood in Great Neck, New York.[5][8][9] All four of Segal's grandparents were Russian-Jewish immigrants,[10][11] and his maternal grandparents changed their surname from Slobodkin to Bodkin.[10] A paternal great-grandfather ran for governor of Massachusetts as a socialist.[12] His oldest brother, John, worked in the hops brokerage business and was an innovator in the cultivation of new hop varieties;[13] the middle brother, Fred, was a screenwriter;[8] and his sister Greta died of pneumonia before he was born.[10]\n",
        "url": "https://en.wikipedia.org/wiki/George_Segal",
        "num_siblings": 3
    },
    {
        "name": "Horatio Sanz",
        "bio": "Sanz was born on June 4, 1969 in Santiago, Chile, to Sylvia and Carlos Sanz.[2] He is the youngest of three sons and the younger brother of actor Carlos Sanz. He grew up in the Humboldt Park neighborhood of Chicago.[3]\n",
        "url": "https://en.wikipedia.org/wiki/Horatio_Sanz",
        "num_siblings": 2
    },
    {
        "name": "Amber Ruffin",
        "bio": "Ruffin was born in Omaha, Nebraska.[1] She graduated from Benson High School in 1996.[8][9]  Ruffin is the youngest of five children. As a child Ruffin learned Signing Exact English to communicate with a deaf neighbor.[10]\n",
        "url": "https://en.wikipedia.org/wiki/Amber_Ruffin",
        "num_siblings": 4
    },
    {
        "name": "Will Rogers",
        "bio": "Rogers was the youngest of eight children. He was named for the Cherokee leader Col. William Penn Adair.[12] Only three of his siblings, sisters Sallie Clementine, Maude Ethel, and May (Mary), survived into adulthood.\n",
        "url": "https://en.wikipedia.org/wiki/Will_Rogers",
        "num_siblings": 7
    },
    {
        "name": "Ryan Reynolds",
        "bio": "Ryan Rodney Reynolds was born on October 23, 1976, in Vancouver, British Columbia. He is the youngest of four sons. His father, James Chester Reynolds, was a Royal Canadian Mounted Policeman before retiring from the force and going to work as a foods wholesaler.[2][3][4] His mother, Tamara Lee (née Stewart) worked in retail sales.[5][6] Reynolds has two brothers who work in law enforcement in British Columbia, one of whom followed his father into the RCMP.[7][8] His paternal grandfather, Chester Reynolds, was a farmer who represented Stettler in the Legislative Assembly of Alberta from 1940 to 1944.[9] Reynolds has Irish and Scottish ancestry, and was raised in the Roman Catholic Church in Vancouver's Kitsilano neighbourhood.[10][11]\n",
        "url": "https://en.wikipedia.org/wiki/Ryan_Reynolds",
        "num_siblings": 3
    },
    {
        "name": "Apollo Quiboloy",
        "bio": "Quiboloy was born on April 25, 1950, in Buhangin, Davao City, specifically in the area of Dumanlas, and is the youngest of nine children of Pampangans José Quiboloy y Turla and María Carreón y Quinto (born December 28, 1913).[10][11][12] Both his parents were natives of Lubao, Pampanga, and had migrated to Davao City following the end of the Second World War to find better opportunities.[13] Quiboloy spent his formative years in Pampanga before moving back to Davao.[13]\n",
        "url": "https://en.wikipedia.org/wiki/Apollo_Quiboloy",
        "num_siblings": 8
    },
    {
        "name": "David Hyde Pierce",
        "bio": "Pierce was born in Saratoga Springs, New York. His father, George Pierce,[2] was an aspiring actor, and his mother, Laura Marie Pierce (née Hughes),[2] was an insurance agent.[1] He is the youngest of four children: he has two older sisters, Barbara and Nancy and one older brother, Thomas.[3][4] He adopted the middle name Hyde to avoid confusion with another actor named David Pierce.[5] As a child, Pierce frequently played organ at the local Bethesda Episcopal Church.[6] As a child, Pierce attended the all boys' sleepaway summer camp Kabeyun, where he first began acting in their camp productions of Gilbert &amp; Sullivan and directed their production of H.M.S. Pinafore.[7]\n",
        "url": "https://en.wikipedia.org/wiki/David_Hyde_Pierce",
        "num_siblings": 3
    },
    {
        "name": "Minnie Pearl",
        "bio": "Sarah Colley was born in Centerville in Hickman County, Tennessee, 50 miles (80 km) southwest of Nashville. She was the youngest of five daughters born to a prosperous sawmill owner and timber dealer in Centerville.[3]\n",
        "url": "https://en.wikipedia.org/wiki/Minnie_Pearl",
        "num_siblings": 4
    },
    {
        "name": "Candy Palmater",
        "bio": "Palmater was born December 4, 1968, in Point La Nim, New Brunswick,[5] and grew up the youngest of seven children.[1] She attended Dalhousie Regional High School, where she was active in sports.[6] \n",
        "url": "https://en.wikipedia.org/wiki/Candy_Palmater",
        "num_siblings": 6
    },
    {
        "name": "Chris O%27Dowd",
        "bio": "O'Dowd was born and raised in Boyle, County Roscommon on 9 October 1979. His father, Seán, is a sign designer, and his mother, Denise, a counsellor and psychotherapist.[4][5][6] He is the youngest of five siblings.[7]\n",
        "url": "https://en.wikipedia.org/wiki/Chris_O%27Dowd",
        "num_siblings": 4
    },
    {
        "name": "Jacqueline Novak",
        "bio": "Novak was born in Winston-Salem, North Carolina, the daughter of Gregory Novak, a retired marketing executive, and Naomi (Wall) Novak.[9] Her mother is Jewish, her father is not.[10]   She is the youngest of three children.[11] The family moved to Chappaqua, New York when she was two years old.[12] She attended Horace Greeley High School there and then went on to Georgetown University.[13] Novak and John Mulaney were in the same college improv troupe at Georgetown, both cast by Nick Kroll, who himself was cast in that troupe a couple of years earlier by Mike Birbiglia.[14]\n",
        "url": "https://en.wikipedia.org/wiki/Jacqueline_Novak",
        "num_siblings": 2
    },
    {
        "name": "Laraine Newman",
        "bio": "Newman was born on March 2, 1952,[2][3] in Los Angeles, California,[4] the granddaughter of a cattle rancher from Arizona. Her family is Jewish.[5] She is the youngest of four children and has a twin brother Paul. Her sister, Tracy Newman, is an Emmy Award-winning television writer. Newman attended Beverly Hills High School in Beverly Hills, California and graduated from there in 1970. Newman married actor-writer-director Chad Einbinder in 1991; their marriage ended after 25 years. Newman and Einbinder have two children, Spike[6] and actor and comedian Hannah.[7]\n",
        "url": "https://en.wikipedia.org/wiki/Laraine_Newman",
        "num_siblings": 3
    },
    {
        "name": "Mo%27Nique",
        "bio": "Mo'Nique was born on December 11, 1967, in Woodlawn, Baltimore County, Maryland,[1] the daughter of engineer Alice Imes and drug counselor Steven Imes, Jr.[3] She is the youngest of four children.  Mo'Nique graduated from Milford Mill High School in Baltimore County in 1985[4] and attended Morgan State University.[5] She is a 1987 graduate of the Broadcasting Institute of Maryland.[6]\n",
        "url": "https://en.wikipedia.org/wiki/Mo%27Nique",
        "num_siblings": 3
    },
    {
        "name": "Matt Mira",
        "bio": "Mira was born in Stoneham, Massachusetts on August 5, 1983 and grew up in Lowell, Massachusetts. He is the youngest of four children. His parents are John and Mary Mira. He has two older sisters Kimberly and Julie, and an older brother John. He was raised Catholic, and attended Lowell Catholic High School. After high school he attended local colleges. He left Massachusetts for Los Angeles in 2007 to pursue a career in comedy.[citation needed]\n",
        "url": "https://en.wikipedia.org/wiki/Matt_Mira",
        "num_siblings": 3
    },
    {
        "name": "Bonnie McFarlane",
        "bio": "McFarland was born March 28, 1973 in Cold Lake, Alberta, Canada,[3] the youngest of four daughters.[4] She was raised on her parents' rural farm outside Cold Lake.[4]\n",
        "url": "https://en.wikipedia.org/wiki/Bonnie_McFarlane",
        "num_siblings": 3
    },
    {
        "name": "Matt McCarthy (comedian)",
        "bio": "Matthew McCarthy, the youngest of three, was born in Providence, Rhode Island at the old Women &amp; Infants Hospital on Maude Street. He grew up in an Irish-Catholic home in Rumford, Rhode Island and attended St. Margaret's School and La Salle Academy.[2]\n",
        "url": "https://en.wikipedia.org/wiki/Matt_McCarthy_(comedian)",
        "num_siblings": 2
    },
    {
        "name": "Ralphie May",
        "bio": "May was born in Chattanooga, Tennessee[2] and raised in Clarksville, Arkansas.[3] He was the youngest of four children.[citation needed]\n",
        "url": "https://en.wikipedia.org/wiki/Ralphie_May",
        "num_siblings": 3
    },
    {
        "name": "Sean Lock",
        "bio": "Lock was born in Chertsey, Surrey, on 22 April 1963.[6][7][8][5] His father was Sidney Lock, who worked in the building industry, and his mother was Mary (née McCreesh),[5] whose family hailed from Cullaville, County Armagh.[9] Lock,  the youngest of four children, was raised in Woking, Surrey, where he attended St John the Baptist School.[5]\n",
        "url": "https://en.wikipedia.org/wiki/Sean_Lock",
        "num_siblings": 3
    },
    {
        "name": "Lucy Liu",
        "bio": "Liu was born on December 2, 1968, in Jackson Heights, Queens, New York. In high school, she adopted a middle name, Alexis.[2] She is the youngest of three children born to Cecilia, who worked as a biochemist, and Tom Liu, a trained civil engineer who sold digital clock pens.[3][4] Liu's parents originally came from Beijing and Shanghai and immigrated to Taiwan as adults before meeting in New York.[3][5][6][7] She has an older brother, John,[8][9][10][11] and an older sister, Jenny.[12] Her parents worked many jobs while Lucy and her siblings were growing up.[13]\n",
        "url": "https://en.wikipedia.org/wiki/Lucy_Liu",
        "num_siblings": 2
    },
    {
        "name": "Richard Lewis (comedian)",
        "bio": "Lewis was born in Brooklyn, New York, and raised in Englewood, New Jersey.[2] His family is Jewish, but not especially religious.[3] His father, Bill (d. 1971), was co-owner of Ambassador Caterers in nearby Teaneck, New Jersey[4] and his mother, Blanche, was an actress in community theatre.[2][5][6] Lewis is the youngest of three siblings – his brother was older than him by 6 years, and his sister by 9.[2][7][8] Lewis's father's catering business kept his father very busy, and his siblings had both left home by the 1960s, leaving Lewis at home alone with his mother, with whom he did not get along.[7] Lewis told The Washington Post in 2014 that he suspected that his birth had been a mistake.[7]\n",
        "url": "https://en.wikipedia.org/wiki/Richard_Lewis_(comedian)",
        "num_siblings": 2
    },
    {
        "name": "Jenifer Lewis",
        "bio": "Lewis was born in Kinloch, Missouri, a suburb of St. Louis, to a nurse's aide mother, Dorothy, and a factory worker father. Lewis is the youngest of seven children. She sang in her church choir at the age of five. She attended Kinloch High School and then college at Webster University in Webster Groves, Missouri. She received an honorary degree from Webster in 2015.[4] After college, Lewis moved to New York to focus on her career in performing.[citation needed]\n",
        "url": "https://en.wikipedia.org/wiki/Jenifer_Lewis",
        "num_siblings": 6
    },
    {
        "name": "Hugh Laurie",
        "bio": "James Hugh Calum Laurie was born on 11 June 1959 in the Blackbird Leys area of Oxford,[5][6] the youngest of four children of Patricia (née Laidlaw) and William George Ranald Mundell \"Ran\" Laurie, who was a physician and winner of an Olympic gold medal in the coxless pairs (rowing) at the 1948 London Games.[6][7] He has an older brother, Charles Alexander Lyon Mundell Laurie,[6] and two older sisters, Susan and Janet.[8][9] He had a strained relationship with his mother,[6][10] whom he noted as \"Presbyterian by character, by mood\".[6] He later said, \"I was frustration to her. She didn't like me.\"[6] His mother died from motor neurone disease in 1989, at the age of 73. According to Laurie, she endured the disease for two years and suffered \"painful, plodding paralysis\" while being cared for by Laurie's father, whom he has called \"the sweetest man in the whole world\".[9]\n",
        "url": "https://en.wikipedia.org/wiki/Hugh_Laurie",
        "num_siblings": 3
    },
    {
        "name": "John Krasinski",
        "bio": "John Burke Krasinski was born on October 20, 1979, at St. Elizabeth's Hospital in the Brighton neighborhood of Boston,[4] the youngest of three boys of nurse Mary Clare (née Doyle; born 1949) and internist Ronald Krasinski (born 1946).[5][6][7][8][9] His mother is of Irish ancestry, while his father is of Polish descent. He was raised Catholic[10] in the Boston suburb of Newton, Massachusetts.\n",
        "url": "https://en.wikipedia.org/wiki/John_Krasinski",
        "num_siblings": 2
    },
    {
        "name": "Jack Klugman",
        "bio": "Klugman was born in Philadelphia,[3] the youngest of six children born to Rose, a hat maker, and Max Klugman, a house painter.[4] His parents were Russian-Jewish immigrants.[5] Klugman served in the United States Army during World War II.[6][7] He attended Carnegie Institute of Technology, now Carnegie Mellon University, in Pittsburgh.[8] While there, his drama teacher told him, \"Young man, you are not suited to be an actor. You are suited to be a truck driver.\"[9] After the war, he pursued acting roles in New York City while sharing an apartment with friend, and fellow ex-GI turned actor Charles Bronson.[7]\n",
        "url": "https://en.wikipedia.org/wiki/Jack_Klugman",
        "num_siblings": 5
    },
    {
        "name": "Don Knotts",
        "bio": "Knotts was born in West Virginia, the youngest of four children. In the 1940s, before earning a college degree, he served in the United States Army and in World War II. While enlisted, he chose to become a ventriloquist and comedian as part of a G.I. variety show called \"Stars and Gripes\".\n",
        "url": "https://en.wikipedia.org/wiki/Don_Knotts",
        "num_siblings": 3
    },
    {
        "name": "Jen Kirkman",
        "bio": "Kirkman was born in Needham, Massachusetts on August 28, 1974,[3] and is the youngest of three sisters. She is of German, Polish, French-Canadian and English heritage.[4]\n",
        "url": "https://en.wikipedia.org/wiki/Jen_Kirkman",
        "num_siblings": 2
    },
    {
        "name": "Patsy Kelly",
        "bio": "Kelly was born Sarah Veronica Rose Kelly in Brooklyn, New York to Irish immigrant parents John and Delia Kelly. Her father John was a police officer who left Ballinrobe, County Mayo, Ireland around 1900 to escape persecution. He died in 1942. Her mother Delia died in 1930. She was the youngest of five children, only two of whom were born in America. She acquired the nickname \"Patsy\" by being the butt of her family's gentle teasing and becoming the \"fall guy\" for many of their shenanigans. \"I was always spinning and tripping about the house, usually over chairs.\" She was originally inspired to become a firefighter decades before the field would open to the first FDNY woman in 1982, but her mother enrolled her in a dancing school to keep her off the streets of Manhattan. In 1922 she began her entertainment career in vaudeville as a dancer at the age of 12.[1] Learning how to tap dance at Jack Blue's School of Rhythm and Tap, she befriended future talent and fellow hoofer Ruby Keeler. She had had more than her share of scrapes when she was young. She fell from a fire escape when she was seven, was struck by an automobile when she was eight, and was involved in no less than five accidents in one week at the age of nine. It was at this point her parents decided to send her to dancing school, where she broke her ankle at the end of her first week. She first attended St. Paul's Cathedral School, then Professional Children's School with Keeler.[2][circular reference]\n",
        "url": "https://en.wikipedia.org/wiki/Patsy_Kelly",
        "num_siblings": 4
    },
    {
        "name": "Michael Keaton",
        "bio": "Michael John Douglas, the youngest of seven children, was born at Ohio Valley Hospital in Kennedy Township, Pennsylvania,[4] on September 5, 1951.[5] He was raised between McKees Rocks,[6] Coraopolis and Robinson Township, Pennsylvania.[7][8] His father, George A. Douglas (1905–1977), worked as a civil engineer and surveyor, and his mother, Leona Elizabeth (née Loftus; 1909–2002), was a homemaker, and came from McKees Rocks.[5][9] Keaton was raised in a Catholic family.[10] His mother was of Irish descent,[10][11][12] while his father was of Scottish, Scotch-Irish, German and English ancestry, and was originally from a Protestant family.[13][14][15] Keaton attended Montour High School in Robinson Township, Pennsylvania.[16] He graduated with the Class of 1969, and studied Speech for two years at Kent State University, where he appeared in plays, and returned to Pennsylvania to pursue his career.[17]\n",
        "url": "https://en.wikipedia.org/wiki/Michael_Keaton",
        "num_siblings": 6
    },
    {
        "name": "Danny Kaye",
        "bio": "David Daniel Kaminsky was born in Brooklyn, New York, on January 18, 1911 (though he would later say 1913),[2][3][4][5] to Ukrainian–Jewish immigrants Jacob and Clara (née Nemerovsky) Kaminsky. He was the youngest of three sons. His parents and older brothers Larry and Mac left Yekaterinoslav (then part of Novorossia, Russian empire) two years before Danny's birth; he was their only son born in the United States.[6]\n",
        "url": "https://en.wikipedia.org/wiki/Danny_Kaye",
        "num_siblings": 2
    },
    {
        "name": "Reginald D. Hunter",
        "bio": "Hunter was born in Albany, Georgia, the youngest of nine.[2] He undertook an acting internship in Jackson, Mississippi, at age 20.[3] His mother died in 2004.[4]\n",
        "url": "https://en.wikipedia.org/wiki/Reginald_D._Hunter",
        "num_siblings": 8
    },
    {
        "name": "Anders Holm",
        "bio": "Holm was born the youngest of three boys on May 29, 1981, in Evanston, Illinois, His brothers are Olen (born 1975) and Erik (born 1976).[4] He graduated from Evanston Township High School.[3] In 2003, he graduated from the University of Wisconsin-Madison with a bachelor's degree in history. He was a member of the university's swim team and is of Danish descent.[5] Holm studied at the Second City Conservatory in Los Angeles.[6]\n",
        "url": "https://en.wikipedia.org/wiki/Anders_Holm",
        "num_siblings": 2
    },
    {
        "name": "Richard Herring",
        "bio": "Richard Herring was born in Pocklington, East Riding of Yorkshire, and grew up in Cheddar, Somerset.[9] He is the youngest of three children.[10] He attended The Kings of Wessex School, where his father was the headmaster and maths teacher. This later formed the basis of his 2008 stand-up show, The Headmaster's Son. Herring’s mother was also a teacher.[10] The 2007 ITV comedy drama You Can Choose Your Friends, which he wrote and also starred in, was based on his family.[10] Some of the same characters later featured in the Radio 4 series \"Relativity\".\n",
        "url": "https://en.wikipedia.org/wiki/Richard_Herring",
        "num_siblings": 2
    },
    {
        "name": "Patti Harrison",
        "bio": "Harrison was born in Orient, Ohio, on October 31, 1990,[1] the youngest of seven children of a Vietnamese mother and an American father. Her father, a native of Detroit, was in the U.S. Army and met her mother during the Vietnam War[2] when she was working as a janitor in his barracks.[3] He died of a heart attack when Harrison was six years old.[4][5][6] Her first involvement in comedy came from her participation in an improv team during her time at Ohio University, from which she did not graduate.[2][7]\n",
        "url": "https://en.wikipedia.org/wiki/Patti_Harrison",
        "num_siblings": 6
    },
    {
        "name": "Oliver Hardy",
        "bio": "The family moved to Madison, Georgia, in 1891, the year before Norvell's birth.[3] He was likely born in Harlem, though some sources say that his birth occurred in Covington, Georgia, his mother's hometown. His father died less than a year after his birth. Hardy was the youngest of five children. His older brother Sam drowned in the Oconee River; Hardy pulled him from the river but was unable to resuscitate him.[4]\n",
        "url": "https://en.wikipedia.org/wiki/Oliver_Hardy",
        "num_siblings": 4
    },
    {
        "name": "Chelsea Handler",
        "bio": "Handler was born in Livingston, New Jersey, the youngest of six children of Rita (née Stoecker), a homemaker, and Seymour Handler, a used-car dealer.[7][8][9] Her American father was Ashkenazi Jewish; her German-born mother, who came to the United States in 1958, was a Mormon.[7][10] Her mother was diagnosed with breast cancer in 1989[11] and battled the disease for over 15 years before dying of it in 2006.[12] Handler was raised in Reform Judaism, and had a Bat Mitzvah ceremony.[13][14][15] As an adult, she broke into tears after discovering that her maternal grandfather served in the German army during World War II, on TLC's Who Do You Think You Are? in 2013.[16][17]\n",
        "url": "https://en.wikipedia.org/wiki/Chelsea_Handler",
        "num_siblings": 5
    },
    {
        "name": "Gary Gulman",
        "bio": "Gary Lewis Gulman was born on July 17, 1970 in Peabody, Massachusetts, to Barbara and Philip Gulman. He is the youngest of three brothers, and was raised in a Jewish family.[2][3] Gulman's parents divorced before he was two years old and his family struggled financially.[4]\n",
        "url": "https://en.wikipedia.org/wiki/Gary_Gulman",
        "num_siblings": 2
    },
    {
        "name": "Adam F. Goldberg",
        "bio": "Goldberg was born to a Jewish family[3] in Philadelphia, Pennsylvania, and lived in nearby Jenkintown.[4] His parents are Beverly (née Solomon) (born October 8, 1943) and Murray Goldberg (September 25, 1940 – February 1, 2008);[4] he is the youngest of three sons, with brothers Eric (born August 18, 1967) and Barry (born October 15, 1969).[5] He produced his first play, Dr. Pickup, in 1992 at the age of 15, and won the Philadelphia Young Playwrights Festival.[6]\n",
        "url": "https://en.wikipedia.org/wiki/Adam_F._Goldberg",
        "num_siblings": 2
    },
    {
        "name": "Janey Godley",
        "bio": "Jane Godley is the youngest of four children born to Annie and Jim Currie. She was raised on Kenmore Street in Shettleston, a district in the East End of Glasgow and attended Eastbank Academy. Living in poverty, which was rife in the East End during that time, Godley left school at 16 with no qualifications.[6] Her parents were alcoholic and her mother was also addicted to tranquilisers.[7][8]\n",
        "url": "https://en.wikipedia.org/wiki/Janey_Godley",
        "num_siblings": 3
    },
    {
        "name": "Hannah Gadsby",
        "bio": "Hannah Gadsby was born in Smithton, a small town on the remote north-west coast of Tasmania.[3] She was the youngest of five children.[4][5] She attended Smithton High School from 1990 to 1995. In year 12, she attended Launceston College, where she had a nervous breakdown.[6] She began third-level studies at the University of Tasmania in Hobart but later transferred to the Australian National University,[6] where she earned a bachelor's degree in art history and curatorship in 2003.[7]\n",
        "url": "https://en.wikipedia.org/wiki/Hannah_Gadsby",
        "num_siblings": 4
    },
    {
        "name": "Ned Fulmer",
        "bio": "Keith Douglas Habersberger[31] (born June 18, 1987, in Carthage, Tennessee; /ˈhæbərsbɜːrɡər/ HABB-urs-bur-gur[32]) was born to Donald and Patricia Habersberger. He is the youngest of three brothers.[33][34] He is a graduate of Illinois State University with a Bachelor in acting and French horn.[35] Habersberger is married to Rebecca \"Becky\" Habersberger (née Miller).[36] Habersberger is reportedly 6 feet 3 inches (1.91 m), making him the tallest of the Try Guys.[37]\n",
        "url": "https://en.wikipedia.org/wiki/Ned_Fulmer",
        "num_siblings": 2
    },
    {
        "name": "Jim Gaffigan",
        "bio": "James Christopher Gaffigan was born in Elgin, Illinois,[1]  on July 7, 1966,[2] the youngest of six children born to charity worker and fundraiser Marcia Miriam (née Mitchell) and banker Michael Ambrose Gaffigan.[3][4] He is of Irish descent, with his family's surname originally being Gavahan.[4] His maternal grandfather was Iowa Supreme Court Justice Richard F. Mitchell.[4] Gaffigan was raised in Chesterton, Indiana, and often jokes about growing up in a large family.[5] His mother was accomplished at needlework and received a national award for original design and craftsmanship from the American Needlepoint Guild in 1985.[6] She died of cancer in 1990, aged 53.[6]\n",
        "url": "https://en.wikipedia.org/wiki/Jim_Gaffigan",
        "num_siblings": 5
    },
    {
        "name": "Will Friedle",
        "bio": "Friedle was born in Hartford, Connecticut, the youngest of three boys of Patricia Joan (née Leary) and Gary Allen Friedle, both lawyers. His older brothers are Gary and Greg Friedle.[3][4][5] After committing himself to becoming an actor, Friedle continually commuted from Avon, Connecticut to New York City for auditions. He graduated from Avon High School in 1994.\n",
        "url": "https://en.wikipedia.org/wiki/Will_Friedle",
        "num_siblings": 2
    },
    {
        "name": "Martin Freeman",
        "bio": "Martin John Christopher Freeman[3] was born on 8 September 1971 in Aldershot, Hampshire,[4] the youngest of five children. \n",
        "url": "https://en.wikipedia.org/wiki/Martin_Freeman",
        "num_siblings": 4
    },
    {
        "name": "Beanie Feldstein",
        "bio": "Feldstein was born in Los Angeles, the only daughter of Sharon Lyn (née Chalkin), a costume designer and fashion stylist, and Richard Feldstein, a tour accountant for Guns N' Roses.[7][8][9]  Feldstein is Jewish.[10] She is the youngest of three children; her elder brother is actor Jonah Hill; her eldest brother, Maroon 5 manager Jordan Feldstein (1977–2017), died suddenly of a blood clot at age 40.[11]\n",
        "url": "https://en.wikipedia.org/wiki/Beanie_Feldstein",
        "num_siblings": 2
    },
    {
        "name": "Fortune Feimster",
        "bio": "Feimster was born in Charlotte, North Carolina, to Mike and Ginger Feimster; \nthe youngest of three, with two older brothers, Price and Jay. Fortune is her maternal great-grandmother's maiden name.[1] Growing up in Belmont, North Carolina, she attended Belmont Central Elementary School and Belmont Junior High,[1] subsequently graduating from South Point High School in 1998.[4] That same year, she was presented to society at the Gastonia Debutante Ball.[1] At South Point, she played basketball, softball, and tennis.[1]\n",
        "url": "https://en.wikipedia.org/wiki/Fortune_Feimster",
        "num_siblings": 2
    },
    {
        "name": "Bridget Everett",
        "bio": "Everett is the youngest of six children born to Donn James and Frederica 'Freddie' Everett. Her siblings are Brinton, Brad, Alice, Brian and Brock.[6][7]  As Everett stated on the podcast Amy Schumer Presents: 3 Girls, 1 Keith (episode 2: \"Moms and Stuff\"): “I’m from Manhattan, Kansas - the little apple. And my dad was mayor at one point, and then so was my brother many years later. So we’re kinda like the Kennedys of Manhattan, Kansas.\" Her father, who also served in the Kansas State House, died in 2007.[6]\n",
        "url": "https://en.wikipedia.org/wiki/Bridget_Everett",
        "num_siblings": 5
    },
    {
        "name": "Chris Elliott",
        "bio": "Elliott was born in New York City, and is the youngest of five children of Lee (née Peppers), a model and TV director, and Bob Elliott, who was part of the successful comedy team Bob and Ray.[2][3][4] He grew up on the Upper East Side.[5] He attended the National Theater Institute at the Eugene O'Neill Theater Center for a semester.[6]\n",
        "url": "https://en.wikipedia.org/wiki/Chris_Elliott",
        "num_siblings": 4
    },
    {
        "name": "Jimmy Durante",
        "bio": "Durante was born on the Lower East Side of New York City. He was the youngest of four children born to Rosa (Lentino) and Bartolomeo Durante, both immigrants from Salerno, Campania, Italy.[1] Bartolomeo was a barber.[2][3] Young Jimmy served as an altar boy at St. Malachy Roman Catholic Church, known as the Actor's Chapel.[4]\n",
        "url": "https://en.wikipedia.org/wiki/Jimmy_Durante",
        "num_siblings": 3
    },
    {
        "name": "Bil Dwyer",
        "bio": "Dwyer was born in Evergreen Park, Illinois, the youngest of five children in an Irish Catholic family.[6] He graduated from Southern Illinois University Carbondale in 1984 with a degree in radio and television.[1][7][8] Before landing on comedy as a career Dwyer worked as a DJ, a salesman, and a tour guide at Universal Studios.[9] Dwyer has been married since 1993 and has four children.[10] He lives in Glendale, California.[1]\n",
        "url": "https://en.wikipedia.org/wiki/Bil_Dwyer",
        "num_siblings": 4
    },
    {
        "name": "Tate Donovan",
        "bio": "Donovan was born on September 25, 1963, in Tenafly, New Jersey,[5] to John Timothy Donovan, a surgeon,[6][7][8] and Eileen Frances (née McAllister), both Roman Catholics of Irish descent.[9][10] Donovan is the youngest of six children.[11] He attended Dwight-Englewood School in Englewood, New Jersey, before transferring to Tenafly High School and attending the University of Southern California.[12] He has appeared on television since his teenage years.\n",
        "url": "https://en.wikipedia.org/wiki/Tate_Donovan",
        "num_siblings": 5
    },
    {
        "name": "Jimmy Dore",
        "bio": "Dore has eleven siblings and is the youngest of seven boys.[6][7] Due to his large family, Dore grew accustomed to playing to an audience early in life,[8] and he used comedy to avoid beatings from his older brothers.[7] Dore's father was a policeman who owned a brickwork business.[6] Dore has described his father as being a Reagan Democrat,[9] and in Dore's senior year of high school, he argued with his father against Ronald Reagan's presidency.[10]\n",
        "url": "https://en.wikipedia.org/wiki/Jimmy_Dore",
        "num_siblings": 6
    },
    {
        "name": "Joe DeRita",
        "bio": "DeRita was born into a show-business family in Philadelphia, Pennsylvania, the son of Florenz (DeRita) and Frank Wardell, and of French-Canadian and English ancestry.[2] He was the youngest of 5 brothers. Wardell's father was a stage technician, his mother a professional stage dancer, and the three often acted on stage together from his early childhood. Taking his mother's maiden name, DeRita, the actor joined the burlesque circuit during the 1920s, gaining fame as a comedian.  During World War II, DeRita joined the USO, performing throughout Britain,  France, and the Pacific with such celebrities as Bing Crosby and Randolph Scott. In the 1944 comedy film The Doughgirls, about the housing shortage in wartime Washington, D.C., he had an uncredited role as \"the Stranger\", a bewildered man who repeatedly showed up in scenes looking for a place to sleep.\n",
        "url": "https://en.wikipedia.org/wiki/Joe_DeRita",
        "num_siblings": 4
    },
    {
        "name": "Kat Dennings",
        "bio": "Katherine Victoria Litwack was born on June 13, 1986, in Bryn Mawr, Pennsylvania.[1][2][3] Her mother, Ellen Judith Litwack, is a poet and speech therapist,[4][5] and her father, Gerald J. Litwack, is a molecular pharmacologist, and college professor and chairman. Dennings is the youngest of five children.[1][6] Her family is Jewish.[6][7][1][8] Dennings grew up in Penn Cottage, a historic house built in 1694 in Wynnewood, Pennsylvania, which she claims was haunted.[9]\n",
        "url": "https://en.wikipedia.org/wiki/Kat_Dennings",
        "num_siblings": 4
    },
    {
        "name": "Dom DeLuise",
        "bio": "DeLuise was born in Brooklyn, New York, to Italian American parents Vincenza \"Jennie\" (née DeStefano), a homemaker, and John DeLuise, a public employee (garbage collector). He was the youngest of three children, having an older brother, Nicholas \"Nick\" DeLuise, and an older sister, Antoinette DeLuise-Daurio.[1] DeLuise graduated from Manhattan's High School of Performing Arts and later attended Tufts University in Medford, Massachusetts, where he majored in biology.[2] DeLuise was Roman Catholic and had a particular devotion to the Virgin Mary.[3]\n",
        "url": "https://en.wikipedia.org/wiki/Dom_DeLuise",
        "num_siblings": 2
    },
    {
        "name": "Jack Dee",
        "bio": "Jack Dee was the youngest of three children born to Rosemary (née Stamper) and Geoffrey Dee, after Joanna Innes Dee and David Simon Innes Dee. He was born in the Municipal Borough of Bromley, Kent[3] (now within the London Borough of Bromley) and grew up in Petts Wood[4] before moving with his family to Winchester when he was young. His father was a printer and his mother was the daughter of two repertory actors, Henry Lionel Pope Stamper (1906–1985) and Edna May Howard Innes (1904–1969).[5]\n",
        "url": "https://en.wikipedia.org/wiki/Jack_Dee",
        "num_siblings": 2
    },
    {
        "name": "Charlie Day",
        "bio": "Charles Peckham Day was born in New York City on February 9, 1976.[1][2] His family lived in the Riverdale section of the Bronx. He spent most of his childhood in Middletown, Rhode Island. He is the youngest of two children, with an elder sister named Alice.[4] His father, Dr. Thomas Charles Day, who is of Italian and Irish descent, is a retired professor of music history at Salve Regina University in Newport, Rhode Island and his mother, Mary (née Peckham), was a piano teacher at The Pennfield School in Portsmouth, Rhode Island.[5] His paternal grandfather changed the family name from \"Del Giorno\" to \"Day\"[6][7] to assimilate during WWII[7] and died in a military training accident when his son Thomas was only four.[8]\n",
        "url": "https://en.wikipedia.org/wiki/Charlie_Day",
        "num_siblings": 1
    },
    {
        "name": "Dante (comedian)",
        "bio": "Dante (real name Jay Dante Rusciolelli; born October 2, 1970) is an American comedian, talent agent and activist[1] from Ridgecrest, California.[2] Dante is the youngest of four children. In 1982, Dante and his parents moved to San Diego where he attended Patrick Henry High School.\n",
        "url": "https://en.wikipedia.org/wiki/Dante_(comedian)",
        "num_siblings": 3
    },
    {
        "name": "Bill Dana",
        "bio": "Dana was born William Szathmary in Quincy, Massachusetts, the youngest of six children born to Joseph and Dena Szathmary. He was of Hungarian Jewish descent.[2] He took his stage name \"Dana\" after his mother's first name \"Dena\" as he felt \"Szathmary\" was unpronounceable.[3]\n",
        "url": "https://en.wikipedia.org/wiki/Bill_Dana",
        "num_siblings": 5
    },
    {
        "name": "Peter F. Dailey",
        "bio": "He was born in Manhattan, New York City, on January 5, 1868. He was raised in Brooklyn along the banks of the East River.[2][3]\n[4][5]\nDailey was the youngest of two sons and a daughter born to New York natives, Owen and Mary Dailey.[6] In later years friends of his father, who was a fishmonger and active in city politics, would say of his son Peter that the apple did not fall far from the tree.[7] By time of the 1880 census Dailey and his siblings were being raised by their widowed mother. She supported her family working as a dressmaker, while William, her sixteen-year-old son helped out as a salesman.[8]  Dailey had a much younger brother, Robert L. Dailey (1885–1934), who became a vaudeville player active in the early years of the twentieth century.[2] As a young boy Dailey enjoyed hanging about the docks and piers that populated the banks of the East River at that time, often bantering with the odd assortment of stevedores, sailors, and steamship passengers that would cross his path.[3]\n",
        "url": "https://en.wikipedia.org/wiki/Peter_F._Dailey",
        "num_siblings": 1
    },
    {
        "name": "Mark Curry (actor)",
        "bio": "Born in Oakland, California Curry is the youngest of nine. Curry attended St. Joseph Notre Dame High School in Alameda, California, and California State University, East Bay[8] in Hayward, California. As a child, Curry was a participant at the East Oakland Youth Development Center (EOYDC), a local youth organization.[9]\n",
        "url": "https://en.wikipedia.org/wiki/Mark_Curry_(actor)",
        "num_siblings": 8
    },
    {
        "name": "Stephanie Courtney",
        "bio": "Courtney was born in Stony Point, Rockland County, New York, the youngest of three children[3] of a high school history teacher father and a singer mother.[1]  In 1992, she graduated with a degree in English from Binghamton University, where she played Elizabeth Proctor in The Crucible. By then, she said, \"I was never tortured over whether I wanted to become an actress. There was never another option in my mind.\"[4] After graduation, she moved to New York City, where her roommate was future author and columnist Meghan Daum.[1] While working as evening secretary for Smith Barney chairman Robert F. Greenhill, Courtney studied acting at the Neighborhood Playhouse.[1]\n",
        "url": "https://en.wikipedia.org/wiki/Stephanie_Courtney",
        "num_siblings": 2
    },
    {
        "name": "Stephen Colbert",
        "bio": "Colbert was born in Washington, D.C.,[2][9] the youngest of eleven children in a Catholic family.[10][11] He spent his early years in Bethesda, Maryland.[12] He grew up in the Charleston suburb of James Island, South Carolina. Colbert and his siblings, in descending order by age, are James III, Edward, Mary, William, Margo, Thomas, Jay, Elizabeth, Paul, Peter, and Stephen. His father, James William Colbert Jr., was an immunologist and medical school dean at Yale University, Saint Louis University, and finally at the Medical University of South Carolina, where, from 1969, he served as the school's first vice president of academic affairs.[13] Stephen's mother, Lorna Elizabeth Colbert (née Tuck), was a homemaker.[14][15][16][17]\n",
        "url": "https://en.wikipedia.org/wiki/Stephen_Colbert",
        "num_siblings": 10
    },
    {
        "name": "Bridget Christie",
        "bio": "Christie grew up in Gloucester, England, the youngest of nine siblings born to Irish parents. She attended St Peter's Roman Catholic High School in Gloucester.[3]\n",
        "url": "https://en.wikipedia.org/wiki/Bridget_Christie",
        "num_siblings": 8
    },
    {
        "name": "Michael Che",
        "bio": "Michael Che Campbell was born in Manhattan, New York City, New York, the youngest of seven children of Rose and Nathaniel Campbell.[5] His father named Michael after the revolutionary Che Guevara.[6]\n",
        "url": "https://en.wikipedia.org/wiki/Michael_Che",
        "num_siblings": 6
    },
    {
        "name": "Art Carney",
        "bio": "Carney, the youngest of six sons (his brothers were Jack, Ned, Robert, Fred, and Phil), was born in Mount Vernon, New York, the son of Helen (née Farrell) and Edward Michael Carney, a newspaperman and publicist.[citation needed] His family was Irish American and Catholic.[2] He attended A.B. Davis High School.[3]\n",
        "url": "https://en.wikipedia.org/wiki/Art_Carney",
        "num_siblings": 5
    },
    {
        "name": "Linda Cardellini",
        "bio": "Cardellini was born in Redwood City, California,[1] the daughter of Lorraine Cardellini (née Hernan), a homemaker, and Wayne David Cardellini, a businessman.[2] She is the youngest of four children.[2] Cardellini is of Italian, Irish, German, and Scottish descent.[3][4] She was raised Catholic.[5] She made her first public appearance at age 10, when she sang in a school play. Subsequently, she acted in several school productions and started attending drama lessons.[6] She graduated from nearby Mountain View's Catholic St. Francis High School in 1993,[7] then moved to Los Angeles to seek roles in television and film.[6]\n",
        "url": "https://en.wikipedia.org/wiki/Linda_Cardellini",
        "num_siblings": 3
    },
    {
        "name": "Steve Carell",
        "bio": "Carell was born at Emerson Hospital in Concord, Massachusetts, the youngest of four brothers, and raised in nearby Acton, Massachusetts. His father, Edwin A. Carell (1925-2021),[7] was an electrical engineer,[8][9] and his mother, Harriet Theresa (née Koch; 1925–2016),[10] was a psychiatric nurse. His maternal uncle, Stanley Koch, worked with scientist Allen B. DuMont to create the cathode ray tubes.[11] His father was of Italian and German descent and his mother was of Polish ancestry.[12] His father's surname was originally Caroselli but it was changed to Carell in the 1950s.[13]\n",
        "url": "https://en.wikipedia.org/wiki/Steve_Carell",
        "num_siblings": 3
    },
    {
        "name": "Lizzy Caplan",
        "bio": "Elizabeth Anne Caplan was born on June 30, 1982, in Los Angeles, California,[1] and grew up in its Miracle Mile district.[2] Her family are Reform Jews of Ashkenazi Jewish descent.[3][4][5] She had a Bat Mitzvah and attended Jewish summer camp.[6][7][8] Her father, Richard Caplan, was a lawyer and her mother, Barbara (née Bragman), was a political aide.[9] She is the youngest of three children with a brother, Benjamin, and a sister, Julie.[10] Her mother died of cancer[11] when she was 13 years old.[2][12][13] Her uncle is publicist Howard Bragman.[14] Caplan attended Alexander Hamilton High School,[15] and attended the school's Academy of Music. She first focused on playing the piano, then later decided to pursue drama.[16] She was also on her school's soccer team.[17] She graduated in 2000, but did not attend college because she wanted to focus on acting.[17]\n",
        "url": "https://en.wikipedia.org/wiki/Lizzy_Caplan",
        "num_siblings": 2
    },
    {
        "name": "Sid Caesar",
        "bio": "Caesar was the youngest of three sons. He was Jewish.[3] He was born in Yonkers, New York.[4][5] His father was Max Ziser (1874–1946) and his mother was Ida (née Raphael) (1887–1975). They likely were from Dąbrowa Tarnowska, Poland.[6]  Reports state that the surname \"Caesar\" was given to Max, as a child, by an immigration official at Ellis Island.[7][8][9] According to Marian L. Smith, senior historian of the U.S. Citizenship and Immigration Service, there is no known case of a name changed at Ellis Island.[10]\n",
        "url": "https://en.wikipedia.org/wiki/Sid_Caesar",
        "num_siblings": 2
    },
    {
        "name": "Amanda Bynes",
        "bio": "Bynes was born in Thousand Oaks, California, on April 3, 1986,[5] the youngest of three children born to Lynn (née Organ), a dental assistant and office manager, and Rick Bynes, a dentist.[6] Her father is Catholic and is of Irish, Lithuanian, and Polish descent.[7] Her mother is Jewish, and was born to a Canadian couple whose families were from Poland, Russia, and Romania.[8][9]\n",
        "url": "https://en.wikipedia.org/wiki/Amanda_Bynes",
        "num_siblings": 2
    },
    {
        "name": "Albert Brooks",
        "bio": "Brooks was born Albert Lawrence Einstein on July 22, 1947 into a Jewish show business family in Beverly Hills, California,[3][1] to Thelma Leeds (née Goodman), an actress, and Harry Einstein, a radio comedian who performed on Eddie Cantor's radio program and was known as \"Parkyakarkus\".[1] He is the youngest of three sons. His older brothers are the late comedic actor Bob Einstein (1942–2019), better known as a character he created named \"Super Dave Osborne\", his Officer Judy character on the Smothers Brothers Comedy Hour, and for a recurring role in Curb Your Enthusiasm; and Clifford Einstein (b. 1939), a partner and longtime chief creative officer at Los Angeles advertising agency Dailey &amp; Associates. His older half-brother was Charles Einstein (1926–2007), a writer for such television programs as Playhouse 90 and Lou Grant. His grandparents emigrated from Austria and Russia. He grew up among show business families in southern California, attending Beverly Hills High School with Richard Dreyfuss and Rob Reiner.[4]\n",
        "url": "https://en.wikipedia.org/wiki/Albert_Brooks",
        "num_siblings": 2
    },
    {
        "name": "Neal Brennan",
        "bio": "Brennan was born in Villanova, Pennsylvania, on October 19, 1973,[1][2][3] the youngest of 10 children born into a family of Irish Catholic descent.[1][4][5] He lived in Villanova until the age of six,[1][6] moving with his family in 1978 to Wilmette, Illinois.[4][7] According to Brennan, his father's side of the family was funny, as were his five older brothers.[1][5] He has said that he realized he was funny and liked comedy at about 8 or 9 years of age, and had already been performing material for his classmates in a style that emulated comedians David Brenner, Richard Lewis, and Jerry Seinfeld.[8] He watched a large amount of comedy on TV during his high school years, often staying up late to see Late Night with David Letterman and The Arsenio Hall Show.[8]\n",
        "url": "https://en.wikipedia.org/wiki/Neal_Brennan",
        "num_siblings": 9
    },
    {
        "name": "Peter Boyle",
        "bio": "Peter Lawrence Boyle was born in Norristown, Pennsylvania, the son of Alice (née Lewis) and Francis Xavier Boyle.[2] He was the youngest of three children and had two elder sisters: Alice Duffy (nee Boyle) and Sidney Boyle.[3][4] He moved with his family to nearby Philadelphia.[5] \n",
        "url": "https://en.wikipedia.org/wiki/Peter_Boyle",
        "num_siblings": 2
    },
    {
        "name": "Joey Bishop",
        "bio": "Bishop, the youngest of five children, was born in the Bronx, New York City, the son of Polish-Jewish immigrants Anna (née Siegel) and Jacob Gottlieb.[1][3][4] His father was a bicycle repairman.[5] Bishop was raised in South Philadelphia, Pennsylvania.[5]\n",
        "url": "https://en.wikipedia.org/wiki/Joey_Bishop",
        "num_siblings": 4
    },
    {
        "name": "Mike Birbiglia",
        "bio": "Birbiglia was born in Shrewsbury, Massachusetts, the son of Mary Jean (née McKenzie), a nurse, and Vincent Paul Birbiglia, a doctor. He is the youngest of four children.[3] He is partially of Italian descent and was raised Catholic.[4][5] Birbiglia attended the all-boys Catholic school St. John's High School for one year, and graduated from St. Mark's School in 1996.[6][7] He says seeing comedian Steven Wright perform inspired him to begin writing jokes at age 16.[8] He subsequently attended Georgetown University in Washington, D.C., graduating in 2000.[9] During college he performed as a member of the Georgetown Players Improv Troupe, worked as a server in a comedy club, and began performing at DC Improv (The Improv) in Washington, D.C.[10][8]\n",
        "url": "https://en.wikipedia.org/wiki/Mike_Birbiglia",
        "num_siblings": 3
    },
    {
        "name": "Matthew Baynton",
        "bio": "Baynton was born in Southend-on-Sea, Essex.\nHe is the youngest of three boys, with two older brothers, Daniel and Andrew. He was educated at Southend High School for Boys. He graduated with first class honours from the Rose Bruford College of Speech and Drama,[2] and later trained in clowning at École Philippe Gaulier in Paris. Baynton explained his motivation in an interview with Metro: \"The performing instinct came from making my family laugh, so I've always been drawn to the funny side of things. Comedy is really rewarding.\"[3]\n",
        "url": "https://en.wikipedia.org/wiki/Matthew_Baynton",
        "num_siblings": 2
    },
    {
        "name": "Cristela Alonzo",
        "bio": "Alonzo was raised in San Juan, Texas, the youngest of four children of mother Natalia Gonzalez, who worked double shifts at a Mexican restaurant for about 20 years,[5] and father Adalberto Alonzo, both of whom were from Mexico. When Alonzo's mother was pregnant with Alonzo, Alonzo's mother left her abusive husband and raised the children alone.[2] Alonzo has explained that she never met her father, who died in 2009.[6]\n",
        "url": "https://en.wikipedia.org/wiki/Cristela_Alonzo",
        "num_siblings": 3
    }
]